lululu-913/F280049_AC-DC-AC_26competition/controller.c
float U_REF = 24.0f;                                                        // 满功率输入交流额定有效值为24V
float I_REF = 0.0f;                                                         // 保留的整流输入电流参考初值
volatile float U_BUS_REF = 47.5f;                                           // 整流输出直流母线默认目标电压为47.5V
volatile float U_OUT_REF = 17.3205f;                                        // 三相相电压目标为17.3205Vrms，对应线电压30Vrms
volatile Uint16 output_freq_hz = 50U;                                       // 三相逆变输出频率命令，KEY1/KEY2在45～505Hz内调节
float U_RMS = 0;                                                            // 保留的采样电压有效值变量
float I_RMS = 0;                                                            // 保留的采样电流有效值变量

int i = 0, j = 0;                                                           // 保留的通用计数器
volatile int rectifier_enable = 0;                                          // 整流独立模式命令：0被动整流、1主动整流
volatile int inverter_enable = 0;                                           // 逆变独立模式命令：0请求关断、1请求运行
int rectifier_enable_last = 0;                                              // 保存上一拍整流命令以检测KEY3切换边沿
int inverter_enable_last = 0;                                               // 保存上一拍逆变命令以检测KEY6切换边沿
volatile int tag = 0;                                                       // 仅供在线观察的组合状态位：bit1整流、bit0逆变
int inverter_pwm_start_stage = 0;                                           // 逆变PWM启动阶段：0关断、1预装、2待释放、3正常运行
int rectifier_pwm_start_stage = 0;                                          // 整流PWM启动阶段：0关断、1预装、2待释放、3正常运行
int inverter_soft_stop_active = 0;                                          // 逆变软关断状态：1时逐步把调制幅值降为零
float inverter_soft_gain = 0.0f;                                            // 逆变三相正弦幅值系数：0完全降幅、1正常输出
volatile int rectifier_fault = 0;                                           // 整流局部故障锁存，不直接关断逆变侧
volatile int system_fault = 0;                                              // 预留的全局故障锁存；母线过压不再置位该标志
int oled_row = 0;                                                           // 保存下一次需要刷新的OLED行号
int N_oled = 0;                                                             // OLED刷新请求的20kHz分频计数器
volatile int oled_refresh_request = 1;                                      // OLED按行刷新请求标志，上电后先请求刷新第0行
int N = 200;                                                                // 10ms统计窗口长度，与三相输出频率相互独立
float sum1 = 0, sum2 = 0;                                                   // 独立保存母线平均值累加及逆变输出平方累加
int N_c1 = 0, N_c2 = 0;                                                     // 分别作为整流母线窗口和逆变输出窗口计数器
float M = 1.94f;                                                            // 47.5V母线输出30V线电压时的额定SVPWM调制分母
volatile int flag = 0;                                                      // 保护原因标志，由控制ISR写入并由主循环显示

float U_ia = 0, U_ib = 0, U_ic = 0;                                         // 保留的三相输入电压变量
float U_oa = 0, U_ob = 0, U_oc = 0;                                         // 重构得到的三相输出相电压
float U_oab = 0, U_obc = 0, U_oac = 0;                                      // 三相输出线电压变量
float U_iab = 0, U_ibc = 0, U_iac = 0;                                      // 保留的三相输入线电压变量
float Iref_a = 0, Iref_b = 0, Iref_c = 0;                                   // 保留的三相电流参考值
float theta_a = 0, theta_b = 0, theta_c = 0;                                // 三相SPWM参考相位
float Da = 0.4, Db = 0.4, Dc = 0.4;                                         // 保留的三相占空比变量
float U_bus = 0;                                                            // 直流母线瞬时采样值
float U_av = 0;                                                             // 由三相相电压计算的瞬时等效有效值

float U_in = 0, U_out = 0;                                                  // 输入电压及保留的输出电压变量
float I_in = 0, I_out = 0;                                                  // 输入电流及保留的输出电流变量
volatile float U_bus_rms = 0;                                               // 直流母线10ms平均值，由控制ISR更新并由主循环显示
volatile float U_out_rms = 0;                                               // 三相交流输出窗口有效值，由控制ISR更新并由主循环显示
float pid_out = 0;                                                          // 母线电压外环累计得到的输入电流正峰值
float pll_out = 0;                                                          // 乘入PLL相位后的电流参考值
float D1 = 0.5f;                                                            // 整流左桥臂占空比，右桥臂使用1-D1
float middle = 0;                                                           // 输入电流内环补偿量及桥臂参考电压中间变量
volatile float I_ref_mag = 0.0f;                                            // 母线电压外环给出的带符号电流峰值，保留原有负幅值约定
float i_l_ref = 0.0f;                                                       // 整流电感与输入电压同相的瞬时电流参考
float err_i = 0.0f;                                                         // 比例电流环的瞬时跟踪误差
float u_i_out = 0.0f;                                                       // 比例电流控制器输出电压补偿量
float i_ctrl = 0.0f;                                                        // 电流补偿与输入电压前馈合成的桥侧电压指令
volatile float Di = 0.0f;                                                   // ISR更新的单极性整流调制量，后台OLED读取其快照
float v_dc_bus = 10.0f;                                                     // 单极性调制归一化使用的实时母线电压
float k_i = RECTIFIER_CURRENT_KP;                                           // 比例电流环增益，保留为变量便于小功率调试

float av = 0;                                                               // 保留的ADC标定平均值
float su = 0;                                                               // 保留的ADC标定累加值
int c = 0;                                                                  // 保留的ADC标定计数器
int g_j = 0;                                                                // 保留的全局计数变量
int g_i = 0;                                                                // 保留的全局计数变量
int g_k = 0;                                                                // 保留的全局计数变量

//************* 锁相环参数 *************//
float W0 = 314.159f;                                                        // 50Hz额定角频率100π
float W1 = 314.159f;                                                        // PLL估算角频率，初值为50Hz
float W1_pi = 0.0f;                                                        // PLL估算频率的Hz显示量
float Ts = 0.00005f;                                                        // PLL采样周期为50微秒，对应20kHz控制中断
float k = 1.0f;                                                             // SOGI传递函数比例系数
float x = 0.0f;                                                             // 输入电压与SOGI α轴输出的瞬时误差
float Ua = 0.0f;                                                            // SOGI生成的α轴正交分量
float Ub = 0.0f;                                                            // SOGI生成的β轴正交分量
float Ud = 0.0f;                                                            // PLL同步旋转坐标系d轴分量
float Uq = 0.0f;                                                            // PLL同步旋转坐标系q轴分量
float theta = 0.0f;                                                         // PLL输出电角度
float kp = 100.0f;                                                          // 采用已核对版本的PLL比例参数
float ki = 10.0f;                                                           // 采用已核对版本的PLL积分参数
float err = 0.0f;                                                           // PLL当前q轴误差
float last_err = 0.0f;                                                      // PLL上一拍q轴误差
float result = 0.0f;                                                        // PLL本拍角频率修正增量

//************* PR控制器参数 *************//
float b0 = 3.13647E-01;                                                     // PR控制器当前输入系数
float b2 = -3.13647E-01;                                                    // PR控制器两拍前输入系数
float a1 = -1.99662;                                                        // PR控制器一阶反馈系数
float a2 = 9.96864E-01;                                                     // PR控制器二阶反馈系数
float out0a = 0;                                                            // PR控制器当前输出状态
float out1a = 0;                                                            // PR控制器上一拍输出状态
float out2a = 0;                                                            // PR控制器前两拍输出状态
float in0a = 0;                                                             // PR控制器当前输入状态
float in1a = 0;                                                             // PR控制器上一拍输入状态
float in2a = 0;                                                             // PR控制器前两拍输入状态
float y1 = 0;                                                               // PR比例项与谐振项合成输出

//******************* 主函数 *******************//
void main(void)                                                             // 程序入口，完成F280049外设和控制器初始化
{
#ifdef _FLASH                                                               // 仅在Flash构建时启用RAM函数段复制
    memcpy(&RamfuncsRunStart, &RamfuncsLoadStart, (size_t)&RamfuncsLoadSize); // 把需在RAM执行的函数段从Flash复制到RAM
#endif                                                                      // 结束条件编译

