lululu-913/F280049_AC-DC-AC_26competition/controller.c
    InitSysCtrl();                                                          // 按目标工程配置100MHz系统时钟及外设时钟
    InitGpio();                                                             // 恢复GPIO默认配置

    // F280049复位后GPIO配置可能处于锁定状态，配置复用功能前先解锁。
    GPIO_unlockPortConfig(GPIO_PORT_A, 0xFFFFFFFFUL);                       // 解锁对应GPIO端口配置寄存器
    GPIO_unlockPortConfig(GPIO_PORT_B, 0xFFFFFFFFUL);                       // 解锁对应GPIO端口配置寄存器
    GPIO_unlockPortConfig(GPIO_PORT_H, 0xFFFFFFFFUL);                       // 解锁对应GPIO端口配置寄存器

    EALLOW;                                                                 // 允许访问受保护寄存器
    GpioCtrlRegs.GPAGMUX1.bit.GPIO0 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO0 = 1;   // 复用为ePWM1A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO1 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO1 = 1;   // 复用为ePWM1B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO2 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 1;   // 复用为ePWM2A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO3 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 1;   // 复用为ePWM2B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO4 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 1;   // 复用为ePWM3A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO5 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 1;   // 复用为ePWM3B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO6 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO6 = 1;   // 复用为ePWM4A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO7 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO7 = 1;   // 复用为ePWM4B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO8 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO8 = 1;   // 复用为ePWM5A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO9 = 0;  GpioCtrlRegs.GPAMUX1.bit.GPIO9 = 1;   // 复用为ePWM5B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO10 = 0; GpioCtrlRegs.GPAMUX1.bit.GPIO10 = 1;  // GPIO10复用为ePWM6A（未使用）
    GpioCtrlRegs.GPAGMUX1.bit.GPIO11 = 0; GpioCtrlRegs.GPAMUX1.bit.GPIO11 = 1;  // GPIO11复用为ePWM6B（未使用）
    AnalogSubsysRegs.DCDCCTL.bit.DCDCEN = 0;                                // 关闭芯片内部DC-DC以适配外部供电
    EDIS;                                                                   // 重新禁止访问受保护寄存器

    DINT;                                                                   // 初始化期间关闭CPU全局中断
    InitPieCtrl();                                                          // 初始化PIE中断控制器
    IER = 0x0000;                                                           // 清除CPU中断使能寄存器
    IFR = 0x0000;                                                           // 清除CPU中断标志寄存器
    InitPieVectTable();                                                     // 初始化PIE中断向量表

    EALLOW;                                                                 // 允许访问受保护寄存器
    PieVectTable.ADCA1_INT = &adcA1ISR;                                     // 将ADCA1中断向量绑定到控制ISR
    EDIS;                                                                   // 重新禁止访问受保护寄存器

    Init_KEY();                                                             // 配置目标板按键GPIO
    InitADC();                                                              // 上电并配置ADCA与ADCB
    InitEPWM();                                                             // 冻结时基并配置六组ePWM
    InitADCSOC();                                                           // 配置ADC采样通道、触发源和中断源
    PID1_Init();                                                            // 初始化母线电压外环
    PID2_Init();                                                            // 初始化输入电流内环
    PIDa_Init();                                                            // 初始化三相输出电压调节器
    PIDc_Init();                                                            // 初始化保留的备用调节器
    OLED_Init();                                                            // 初始化OLED显示模块
    OLED_ShowString(0, 0, "R  I  F  M      ");                              // 第0行固定显示整流、逆变、故障和调制分母
    OLED_ShowString(0, 1, "BR      B       ");                              // 固定标签仅在上电初始化时写入第1行
    OLED_ShowString(0, 2, "OR      O       ");                              // 固定标签仅在上电初始化时写入第2行
    OLED_ShowString(0, 3, "F       DI      ");                              // 第3行固定显示逆变频率命令和带符号的整流调制量

    IER |= M_INT1;                                                          // 允许CPU响应PIE第1组中断
    PieCtrlRegs.PIEIER1.bit.INTx1 = 1;                                      // 使能PIE第1组第1路ADCA中断

    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 1;                                   // 统一释放全部ePWM时基并同步启动
    EDIS;                                                                   // 重新禁止访问受保护寄存器

    EINT;                                                                   // 开启CPU可屏蔽中断
    ERTM;                                                                   // 开启实时调试中断响应

    for(;;)                                                                 // 进入永久后台循环
    {
        if(oled_refresh_request != 0)                                       // 收到50ms分频产生的OLED刷新请求
        {
            oled_refresh_request = 0;                                       // 先清除请求，避免连续占用后台执行时间
            OLED_output();                                                  // 每次只刷新一行固定变量界面
        }
        if(U_BUS_REF > 55.0f) U_BUS_REF = 55.0f;                            // 参考上限与60V过压保护之间保留5V动态裕量
        if(U_BUS_REF < (1.4142f * U_REF + BUS_REF_HEADROOM_VOLTAGE))         // 保证升压整流母线目标高于输入电压峰值
            U_BUS_REF = 1.4142f * U_REF + BUS_REF_HEADROOM_VOLTAGE;          // 保留约5V调制裕量，避免无法正常控流
        if(U_OUT_REF > 30) U_OUT_REF = 30;                                  // 限制三相输出目标电压上限
        if(U_OUT_REF < 1) U_OUT_REF = 1;                                    // 限制三相输出目标电压下限
        // 控制器参考值在对应100Hz控制窗口内读取，避免主循环直接改写ISR内部状态。
    }
}

//******************* ADC模块初始化 *******************//
void InitADC(void)                                                          // 初始化ADCA、ADCB与ADCC模拟模块
{
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCA);                         // 完整复位ADCA并由驱动库重新装载芯片ADC校准值
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCB);                         // 完整复位ADCB并由驱动库重新装载芯片ADC校准值
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCC);                         // 完整复位ADCC，保证与ADCB共享的模拟参考网络状态一致

    ADC_setVREF(ADCA_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);     // 配置对应ADC使用内部3.3V参考源
    EALLOW;                                                                 // 允许访问受保护寄存器
    AdcaRegs.ADCCTL2.bit.PRESCALE = 6;                                      // 100MHz系统时钟四分频，ADCCLK约25MHz
    AdcaRegs.ADCCTL1.bit.INTPULSEPOS = 1;                                   // 在转换结果锁存后产生ADC中断脉冲
    AdcaRegs.ADCCTL1.bit.ADCPWDNZ = 1;                                      // 给对应ADC模拟模块上电
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    DELAY_US(1000);                                                         // 等待ADC模拟电路上电稳定

    ADC_setVREF(ADCB_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);     // 配置对应ADC使用内部3.3V参考源
    EALLOW;                                                                 // 允许访问受保护寄存器
    AdcbRegs.ADCCTL2.bit.PRESCALE = 6;                                      // 将ADC时钟配置为约25MHz
    AdcbRegs.ADCCTL1.bit.INTPULSEPOS = 1;                                   // 在转换结果锁存后产生ADC中断脉冲
    AdcbRegs.ADCCTL1.bit.ADCPWDNZ = 1;                                      // 给对应ADC模拟模块上电
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    DELAY_US(1000);                                                         // 等待ADC模拟电路上电稳定

    ADC_setVREF(ADCC_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);     // 将共享参考网络上的ADCC也配置为内部3.3V参考
    EALLOW;                                                                 // 允许访问受保护寄存器
    AdccRegs.ADCCTL2.bit.PRESCALE = 6;                                      // 将ADCC时钟配置为约25MHz
    AdccRegs.ADCCTL1.bit.INTPULSEPOS = 1;                                   // 在转换结果锁存后产生ADC中断脉冲
    AdccRegs.ADCCTL1.bit.ADCPWDNZ = 1;                                      // 给ADCC模拟模块上电以稳定ADCB/ADCC共享参考网络
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    DELAY_US(1000);                                                         // 等待ADCC及共享模拟参考网络上电稳定
}

void InitADCSOC(void)                                                       // 配置ADC通道、采样窗、触发源和中断
{
    EALLOW;                                                                 // 允许访问受保护寄存器

    AdcaRegs.ADCBURSTCTL.all = 0;                                           // 关闭ADCA突发转换，防止非预期SOC连续触发
    AdcaRegs.ADCSOCPRICTL.all = 0;                                          // 恢复ADCA默认轮询优先级
    AdcaRegs.ADCINTSOCSEL1.all = 0;                                         // 禁止ADCA ADCINT1～4再次触发SOC0～7
    AdcaRegs.ADCINTSOCSEL2.all = 0;                                         // 禁止ADCA ADCINT1～4再次触发SOC8～15
    AdcaRegs.ADCSOCOVFCLR1.all = 0xFFFF;                                    // 清除ADCA全部SOC触发溢出粘滞标志
    AdcaRegs.ADCINTOVFCLR.all = 0x000F;                                     // 清除ADCA全部ADC中断溢出标志
    AdcaRegs.ADCINTFLGCLR.all = 0x000F;                                     // 清除ADCA全部ADC中断标志

