lululu-913/F280049_AC-DC-AC_26competition/controller.c
    AdcbRegs.ADCBURSTCTL.all = 0;                                           // 关闭ADCB突发转换，确保B0仅由配置的SOCA触发
    AdcbRegs.ADCSOCPRICTL.all = 0;                                          // 恢复ADCB默认轮询优先级
    AdcbRegs.ADCINTSOCSEL1.all = 0;                                         // 禁止ADCB ADCINT1～4再次触发SOC0～7
    AdcbRegs.ADCINTSOCSEL2.all = 0;                                         // 禁止ADCB ADCINT1～4再次触发SOC8～15
    AdcbRegs.ADCSOCOVFCLR1.all = 0xFFFF;                                    // 清除ADCB全部SOC触发溢出粘滞标志
    AdcbRegs.ADCINTOVFCLR.all = 0x000F;                                     // 清除ADCB全部ADC中断溢出标志
    AdcbRegs.ADCINTFLGCLR.all = 0x000F;                                     // 清除ADCB全部ADC中断标志

    // 将F28069的SOC/通道关系分别映射到F280049的ADCA和ADCB。
    AdcaRegs.ADCSOC0CTL.bit.CHSEL = 0;                                      // SOC0选择ADCINA0，采集输入电压U_in
    AdcaRegs.ADCSOC0CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcaRegs.ADCSOC0CTL.bit.TRIGSEL = 9;                                    // 选择ePWM3 SOCA作为硬件触发源

    AdcaRegs.ADCSOC1CTL.bit.CHSEL = 1;                                      // SOC1选择ADCINA1，采集母线电压U_bus
    AdcaRegs.ADCSOC1CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcaRegs.ADCSOC1CTL.bit.TRIGSEL = 9;                                    // 选择ePWM3 SOCA作为硬件触发源

    AdcaRegs.ADCSOC2CTL.bit.CHSEL = 2;                                      // SOC2选择ADCINA2，采集输出线电压U_oab
    AdcaRegs.ADCSOC2CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcaRegs.ADCSOC2CTL.bit.TRIGSEL = 9;                                    // 选择ePWM3 SOCA作为硬件触发源

    AdcaRegs.ADCSOC3CTL.bit.CHSEL = 3;                                      // SOC3选择ADCINA3，采集输出线电压U_obc
    AdcaRegs.ADCSOC3CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcaRegs.ADCSOC3CTL.bit.TRIGSEL = 9;                                    // 选择ePWM3 SOCA作为硬件触发源

    AdcbRegs.ADCSOC0CTL.bit.CHSEL = 0;                                      // SOC0选择ADCINB0，采集输入电流I_in
    AdcbRegs.ADCSOC0CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcbRegs.ADCSOC0CTL.bit.TRIGSEL = 9;                                    // 选择ePWM3 SOCA作为硬件触发源

    // 逆变侧采用纯电压环，因此不再配置ADCB1～3三相电流采样。
    // EOC3是最后一个使用的ADCA结果，此时并行转换的ADCB RESULT0早已完成。
    AdcaRegs.ADCINTSEL1N2.bit.INT1SEL = 3;                                  // 选择ADCA EOC3作为ADCINT1中断源
    AdcaRegs.ADCINTSEL1N2.bit.INT1E = 1;                                    // 使能ADCA INT1中断输出
    AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;                                  // 清除ADCA INT1标志以允许下一次中断

    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

//******************* ADC中断（20kHz控制核心）*******************//
__interrupt void adcA1ISR(void)                                             // 20kHz ADC中断与全部实时控制算法
{
    U_in = ((float)AdcaResultRegs.ADCRESULT0 - 2066.2f) / 36.443f;            // 按y=36.443x+2066.2将ADCINA0原始值反算为输入电压
    U_bus = ((float)AdcaResultRegs.ADCRESULT1 - 2067.9f) / 26.268f;           // 按y=26.268x+2067.9将ADCINA1原始值反算为母线电压
    U_oab = ((float)AdcaResultRegs.ADCRESULT2 - 2066.7f) / 36.353f;           // 按y=36.353x+2066.7将ADCINA2原始值反算为输出线电压Uab
    U_obc = ((float)AdcaResultRegs.ADCRESULT3 - 2067.9f) / 36.169f;           // 按y=36.169x+2067.9将ADCINA3原始值反算为输出线电压Ubc
    I_in = ((float)AdcbResultRegs.ADCRESULT0 - 2077.3f) / 164.61f;            // 按y=164.61x+2077.3将ADCINB0原始值反算为输入电流

    if((system_fault == 0) &&                                               // 已有全局故障时不再用局部故障覆盖OLED故障码
       (fabsf(I_in) > INPUT_OVERCURRENT_LIMIT))                             // 检测输入瞬时电流是否超过7A软件保护阈值
    {
        rectifier_enable = 0;                                               // 整流过流只撤销主动整流命令，不直接改变逆变运行命令
        rectifier_fault = 1;                                                // 锁存整流局部故障，等待KEY3重新确认启动
        rectifier_pwm_start_stage = 0;                                      // 清零整流PWM启动阶段
        PWM_TripRectifier();                                                // 立即Trip ePWM4/5并退回MOSFET体二极管被动整流
        flag = 1;                                                           // 记录输入过流故障
    }
    if(U_bus >= BUS_OVERVOLTAGE_LIMIT)                                      // 每个控制周期检测母线是否超过60V软件保护阈值
    {
        rectifier_enable = 0;                                               // 母线过压时撤销主动整流运行命令
        rectifier_fault = 1;                                                // 将母线过压锁存为整流侧局部故障
        rectifier_pwm_start_stage = 0;                                      // 清零整流PWM启动阶段
        PWM_TripRectifier();                                                // 只Trip ePWM4/5，保持逆变ePWM1～3继续运行
        flag = 2;                                                           // 记录母线过压故障并由OLED显示F2
    }
    if(system_fault != 0)                                                   // 全局故障锁存期间始终保持全部功率级关断
    {
        rectifier_enable = 0;                                               // 禁止全局故障期间重新运行主动整流
        inverter_enable = 0;                                                // 禁止全局故障期间重新运行逆变
        PWM_ForceAllLow();                                                   // 每拍保持全部One-Shot Trip锁存
    }

    PLL1(U_in);                                                             // 停机时也持续锁相，使启动前PLL已经跟踪输入电压

    U_ob = (U_obc - U_oab) * 0.3333f;                                       // 由Uab、Ubc重构B相相电压
    U_oa = U_ob + U_oab;                                                    // 由B相相电压和Uab重构A相相电压
    U_oc = -(U_ob + U_oa);                                                  // 利用三相电压和为零重构C相相电压
    U_av = sqrtf((U_oa * U_oa + U_ob * U_ob + U_oc * U_oc) * 0.3333f);      // 计算三相瞬时等效有效值

    if(rectifier_enable != rectifier_enable_last)                           // 检测KEY3产生的主动整流独立模式切换
    {
        if(rectifier_enable != 0)                                           // KEY3请求启动主动整流
        {
            PWM_TripRectifier();                                            // 启动前保持ePWM4/5的Trip Zone关断锁存
            rectifier_pwm_start_stage = 0;                                  // 等待逆变ePWM1～3先进入正常运行阶段再启动整流
            pid_out = 0.0f;                                                 // 从零开始建立外环电流幅值，避免沿用开环测试给定
            I_ref_mag = 0.0f;                                               // 整流启动前把瞬时电流参考幅值清零
            pid1.Err = 0.0f;                                                // 清零母线外环当前误差
            pid1.Err_last = 0.0f;                                           // 清零母线外环上一拍误差，防止切换冲击
            pid1.result = 0.0f;                                             // 清零母线外环本拍电流增量
            pid1.result_last = 0.0f;                                        // 清零母线外环上一拍电流增量
            pid1.Integral = 0.0f;                                           // 清零保留的外环积分状态
            rectifier_fault = 0;                                            // 用户重新开启时清除整流局部故障锁存
            if(flag == 1) flag = 0;                                         // 仅清除对应的整流过流显示
        }
        else                                                                // KEY3请求停止主动整流
        {
            PWM_TripRectifier();                                            // 只关断ePWM4/5，逆变侧继续根据自身命令和母线运行
            rectifier_pwm_start_stage = 0;                                  // 下次启动必须重新完成CMPA预装流程
            pid_out = 0.0f;                                                 // 清零母线外环累计电流幅值
            I_ref_mag = 0.0f;                                               // 清零整流瞬时电流参考幅值
        }
    }
    rectifier_enable_last = rectifier_enable;                               // 保存当前整流命令供下一拍检测边沿

