lululu-913/F280049_AC-DC-AC_26competition/controller.c
    if(inverter_enable != inverter_enable_last)                             // 检测KEY6产生的逆变独立模式切换
    {
        if(inverter_enable != 0)                                            // KEY6请求启动逆变
        {
            inverter_soft_stop_active = 0;                                  // 新的运行请求取消普通软关断状态
        }
        else if((inverter_pwm_start_stage == 3) && (inverter_soft_gain > 0.0f)) // 运行中的逆变收到KEY6关闭命令
        {
            inverter_soft_stop_active = 1;                                  // 保持PWM工作并开始按10ms节拍降低输出幅值
        }
        else                                                                // 尚未正常输出时收到关闭命令
        {
            PWM_TripInverter();                                             // 无需等待软斜坡，直接保持逆变Trip关断
            inverter_pwm_start_stage = 0;                                   // 清零逆变启动阶段
            inverter_soft_gain = 0.0f;                                      // 清零逆变输出幅值
        }
    }
    inverter_enable_last = inverter_enable;                                 // 保存当前逆变命令供下一拍检测边沿

    if((inverter_enable != 0) && (inverter_pwm_start_stage == 0) &&          // 逆变命令开启且PWM尚未启动
       (system_fault == 0))                                                 // 不再使用母线欠压作为逆变启动限制
    {
        PWM_TripInverter();                                                 // 自动重启前再次确认ePWM1～3保持Trip关断
        inverter_pwm_start_stage = 1;                                       // 进入逆变CMPA预装阶段
        inverter_soft_gain = 0.0f;                                          // 每次启动均从零输出幅值开始
        inverter_soft_stop_active = 0;                                      // 清除旧软关断状态
        pida.Err = 0.0f;                                                    // 清零逆变电压环当前误差
        pida.Err_last = 0.0f;                                               // 清零逆变电压环上一拍误差
        pida.result = 0.0f;                                                 // 清零逆变电压环本拍增量
        pida.result_last = 0.0f;                                            // 清零逆变电压环上一拍增量
        pida.Integral = 0.0f;                                               // 清零逆变电压环保留积分状态
    }

    if((rectifier_enable != 0) && (rectifier_fault == 0) &&                 // 存在主动整流运行请求且整流侧无故障
       (system_fault == 0) && (rectifier_pwm_start_stage == 0) &&           // 整流PWM尚未开始启动
       (inverter_pwm_start_stage == 3))                                     // 必须确认逆变ePWM1～3已经先安全释放
    {
        PWM_TripRectifier();                                                // 预装整流比较值前继续保持ePWM4/5关断
        rectifier_pwm_start_stage = 1;                                      // 逆变已运行后才允许进入整流PWM预装阶段
    }

    N_c1++;                                                                 // 独立累加母线10ms平均值窗口，不再依赖逆变是否运行
    sum1 += U_bus;                                                          // 累加母线瞬时采样供整流外环使用
    if(N_c1 >= N)                                                           // 母线统计窗口达到200个20kHz采样点
    {
        N_c1 = 0;                                                           // 清零母线统计窗口计数
        U_bus_rms = sum1 / N;                                               // 更新母线10ms平均值
        sum1 = 0.0f;                                                        // 清零母线累加器
        if((rectifier_enable != 0) && (rectifier_fault == 0) &&             // 仅主动整流正常请求下更新母线电压外环
           (system_fault == 0))
        {
            pid1.ref = U_BUS_REF;                                           // 读取独立的母线电压目标值
            pid1.result = PID1_Cal(U_bus_rms);                              // 以100Hz更新母线外环电流幅值增量
            if(pid1.result > BUS_CURRENT_SLEW_UP_STEP)                      // 限制正向电流幅值变化率
                pid1.result = BUS_CURRENT_SLEW_UP_STEP;                     // 启动或输入电压降低时约以1.0A/s增加
            else if(pid1.result < -BUS_CURRENT_SLEW_DOWN_STEP)              // 单独限制反向电流幅值变化率
                pid1.result = -BUS_CURRENT_SLEW_DOWN_STEP;                  // 负载减小时约以2.0A/s降低
            pid_out += pid1.result;                                         // 累计得到有功输入电流峰值参考
            if(pid_out > INPUT_CURRENT_PK_MAX) pid_out = INPUT_CURRENT_PK_MAX; // 将母线外环电流峰值参考限制在6A
            if(pid_out < 0.0f) pid_out = 0.0f;                              // PFC仅允许交流侧向直流母线传递有功功率
            I_ref_mag = -pid_out;                                           // 转换为当前PLL相位方向所需的负幅值约定
        }
    }

    if((rectifier_enable != 0) && (rectifier_fault == 0) &&                 // 主动整流命令与局部保护均允许输出
       (system_fault == 0) && (rectifier_pwm_start_stage != 0))             // 已进入整流PWM预装或正常运行阶段
    {
        i_l_ref = I_ref_mag * cosf(theta);                                  // 生成与输入电压同相的瞬时电流参考
        pll_out = i_l_ref;                                                  // 同步旧变量供在线观察瞬时电流参考
        err_i = i_l_ref - I_in;                                             // 计算输入电流瞬时跟踪误差
        u_i_out = k_i * err_i;                                              // 采用原比例控制生成电流补偿电压
        i_ctrl = u_i_out + RECTIFIER_FEEDFORWARD_GAIN * U_in;               // 叠加0.5倍输入电压前馈
        middle = i_ctrl;                                                    // 同步旧中间变量便于在线观察
        if(U_bus > BUS_CONTROL_MIN_VOLTAGE) v_dc_bus = U_bus;               // 正常时使用实时母线电压完成调制解耦
        else v_dc_bus = BUS_CONTROL_MIN_VOLTAGE;                            // 母线过低时使用5V下限避免除零
        Di = i_ctrl / v_dc_bus;                                             // 把桥侧电压指令归一化为单极性调制量
        if(Di > RECTIFIER_MODULATION_LIMIT) Di = RECTIFIER_MODULATION_LIMIT; // 保留原正向调制限幅
        else if(Di < -RECTIFIER_MODULATION_LIMIT) Di = -RECTIFIER_MODULATION_LIMIT; // 保留原负向调制限幅
        D1 = 0.5f * (1.0f + Di);                                            // ePWM4左桥臂占空比采用(1+Di)/2
        EPwm4Regs.CMPA.bit.CMPA = (Uint16)(EPWM_TIMER_TBPRD * D1);          // 更新整流左桥臂中心对齐比较值
        EPwm5Regs.CMPA.bit.CMPA = (Uint16)(EPWM_TIMER_TBPRD * 0.5f * (1.0f - Di)); // 更新整流右桥臂中心对齐比较值
        PWM_ReleaseRectifier();                                             // 独立完成ePWM4/5预装等待和Trip释放
    }
    else
    {
        PWM_TripRectifier();                                                // 非主动整流状态始终保持ePWM4/5 Trip关断
        pll_out = 0.0f;                                                     // 关断主动整流后清零瞬时电流参考观察量
        D1 = 0.5f;                                                          // 显示占空比恢复到中点
        middle = 0.0f;                                                      // 清零整流电流环中间量
        i_l_ref = 0.0f;                                                     // 清零整流瞬时电流参考
        err_i = 0.0f;                                                       // 清零整流比例电流误差
        u_i_out = 0.0f;                                                     // 清零整流比例控制输出
        i_ctrl = 0.0f;                                                      // 清零整流桥侧电压指令
        Di = 0.0f;                                                          // 清零整流差模调制量
    }

