lululu-913/F280049_AC-DC-AC_26competition/controller.c
    if((inverter_pwm_start_stage != 0) && (system_fault == 0))              // 逆变处于预装、待释放或正常运行状态
    {
        theta_a += 2.0f * pi * (float)output_freq_hz * Ts;                  // 每个20kHz控制周期按当前45～505Hz命令推进输出相位
        if(theta_a >= 2.0f * pi) theta_a -= 2.0f * pi;                      // A相相位超过一周时回绕
        theta_b = theta_a + 2.0944f;                                        // B相保持超前A相120度
        if(theta_b >= 2.0f * pi) theta_b -= 2.0f * pi;                      // B相相位超过一周时回绕
        theta_c = theta_a - 2.0944f;                                        // C相保持滞后A相120度
        if(theta_c < 0.0f) theta_c += 2.0f * pi;                            // C相负角度回绕至0～2π
        SVPWM_Calculate(theta_a, theta_b, theta_c, inverter_soft_gain / M,    // 保持原M标定并注入SVPWM零序共模分量
                        &Da, &Db, &Dc);
        EPwm1Regs.CMPA.bit.CMPA = (Uint16)(EPWM_TIMER_TBPRD * Da);           // 将SVPWM A相占空比转换为中心对齐比较值
        EPwm2Regs.CMPA.bit.CMPA = (Uint16)(EPWM_TIMER_TBPRD * Db);           // 将SVPWM B相占空比转换为中心对齐比较值
        EPwm3Regs.CMPA.bit.CMPA = (Uint16)(EPWM_TIMER_TBPRD * Dc);           // 将SVPWM C相占空比转换为中心对齐比较值

        N_c2++;                                                             // 独立累加逆变输出电压10ms统计窗口
        sum2 += U_av * U_av;                                                // 累加三相输出等效电压平方
        if(N_c2 >= N)                                                       // 逆变统计窗口达到200个20kHz采样点
        {
            N_c2 = 0;                                                       // 清零逆变统计窗口计数
            U_out_rms = sqrtf(sum2 / N);                                    // 更新三相输出等效相电压有效值
            sum2 = 0.0f;                                                    // 清零逆变输出平方累加器
            if(inverter_soft_stop_active != 0)                              // KEY6关闭请求逆变软关断
            {
                inverter_soft_gain -= INVERTER_SOFT_GAIN_DOWN_STEP;         // 每10ms降低0.05输出幅值系数
                if(inverter_soft_gain < 0.0f) inverter_soft_gain = 0.0f;    // 防止软关断系数变为负数
            }
            else if(inverter_enable != 0)                                   // KEY6仍保持逆变运行请求
            {
                inverter_soft_gain += INVERTER_SOFT_GAIN_UP_STEP;           // 每10ms增加0.02输出幅值系数
                if(inverter_soft_gain > 1.0f) inverter_soft_gain = 1.0f;    // 正常运行幅值系数最大为1
            }

            pida.ref = U_OUT_REF * inverter_soft_gain;                      // 电压环目标与软启停幅值同步变化以避免相互对抗
            M += PIDa_Cal(U_out_rms);                                       // 保留原逆变电压环对调制分母M的增量调节
            if(M >= 8) M = 8;                                               // 保留原调制分母上限
            if(M <= 1.8f) M = 1.8f;                                         // SVPWM下限保留约1.9%最小占空比裕量

            if((inverter_soft_stop_active != 0) &&                          // 软关断过程已经把幅值降至零
               (inverter_soft_gain <= 0.0f))
            {
                PWM_TripInverter();                                         // 零幅值后再Trip ePWM1～3完成软关断
                inverter_pwm_start_stage = 0;                               // 下次运行必须重新完成CMPA预装
                inverter_soft_stop_active = 0;                              // 结束本次软关断状态
            }
        }

        if(inverter_pwm_start_stage != 0) PWM_ReleaseInverter();            // 独立完成ePWM1～3预装等待和Trip释放
    }
    else                                                                    // 逆变没有运行或已经被保护关断
    {
        PWM_TripInverter();                                                 // 保持ePWM1～3的One-Shot Trip锁存
        EPwm1Regs.CMPA.bit.CMPA = 0;                                        // 清零逆变A相比较值影子寄存器
        EPwm2Regs.CMPA.bit.CMPA = 0;                                        // 清零逆变B相比较值影子寄存器
        EPwm3Regs.CMPA.bit.CMPA = 0;                                        // 清零逆变C相比较值影子寄存器
        sum2 = 0.0f;                                                        // 清零逆变输出平方累加器
        N_c2 = 0;                                                           // 清零逆变输出统计窗口计数
        U_out_rms = 0.0f;                                                   // 关断状态下清零逆变窗口输出值
        theta_a = 0.0f;                                                     // 把A相输出相位复位到零点
        theta_b = 2.0944f;                                                  // 把B相输出相位复位到超前120度
        theta_c = 4.1888f;                                                  // 把C相输出相位复位到滞后120度的等效正角
    }

    N_freq_key++;                                                           // 独立累加KEY1/KEY2频率调节分频计数
    if(N_freq_key >= FREQ_KEY_REPEAT_ISR_DIV)                               // 每5000个20kHz控制周期即250ms处理一次频率按键
    {
        N_freq_key = 0;                                                     // 清零频率按键重复分频计数
        if(KEY_H1 == 0) KEY_Control(KEY1_PRESS);                            // KEY1按下或长按时把频率增加1Hz
        else if(KEY_H2 == 0) KEY_Control(KEY2_PRESS);                       // KEY2按下或长按时把频率减小1Hz
    }

    N_key++;                                                                // 独立累加KEY3～KEY6通用按键扫描分频计数
    if(N_key >= GENERAL_KEY_SCAN_ISR_DIV)                                   // 保持原每10000个控制周期即500ms扫描一次
    {
        N_key = 0;                                                          // 清零按键扫描分频计数
        key = KEY_Scan(0);                                                  // 扫描目标板KEY3～KEY6
        KEY_Control(key);                                                   // 执行按键对应的模式或设定值操作
    }
    tag = ((rectifier_enable != 0) ? 2 : 0) + ((inverter_enable != 0) ? 1 : 0); // 实时组合独立模式状态供在线观察

    N_oled++;                                                               // 累加OLED刷新分频计数
    if(N_oled >= OLED_REFRESH_DIVIDER)                                      // 每1000个控制周期即50ms请求刷新一行
    {
        N_oled = 0;                                                         // 清零OLED刷新分频计数器
        oled_refresh_request = 1;                                           // 通知主循环执行一次单行OLED刷新
    }

    AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;                                  // 清除ADCA INT1标志以允许下一次中断
    if(AdcaRegs.ADCINTOVF.bit.ADCINT1 == 1)                                 // 检查控制ISR是否发生ADC中断溢出
    {
        AdcaRegs.ADCINTOVFCLR.bit.ADCINT1 = 1;                              // 清除ADCA INT1溢出标志
        AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;                              // 清除ADCA INT1标志以允许下一次中断
    }
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;                                 // 应答PIE第1组以接收下一次ADC中断
}

//******************* 锁相环 *******************//
void PLL1(float UI)                                                         // SOGI-PLL输入电压锁相计算
{
    x = UI - Ua;                                                            // 计算输入电压与SOGI α轴输出之差
    Ua = Ua + (x * k - Ub) * W0 * Ts;                                       // 按已核对差分方程更新SOGI α轴分量
    Ub = Ub + Ua * W0 * Ts;                                                 // 按已核对差分方程更新SOGI β轴分量
    Ud = cosf(theta) * Ua + sinf(theta) * Ub;                               // 将αβ分量变换到同步旋转d轴
    Uq = cosf(theta) * Ub - sinf(theta) * Ua;                               // 将αβ分量变换到同步旋转q轴
    err = 0.0f - Uq;                                                        // 以Uq趋近零作为PLL锁相目标
    result = kp * err + ki * (err - last_err);                              // 按已核对写法计算本拍角频率修正量
    last_err = err;                                                         // 保存本拍误差供下一拍差分使用
    W1 -= result;                                                           // 累加修正PLL估算角频率
    if(W1 >= 115.0f * pi) W1 = 115.0f * pi;                                // 将PLL最高频率限制为57.5Hz
    if(W1 <= 85.0f * pi) W1 = 85.0f * pi;                                  // 将PLL最低频率限制为42.5Hz
    W1_pi = W1 / (2.0f * pi);                                               // 把估算角频率换算成Hz供在线观察
    theta += W1 * Ts;                                                       // 使用当前估算角频率推进PLL相位
    if(theta >= 2.0f * pi) theta -= 2.0f * pi;                              // 相位超过一周时回绕到0～2π
    else if(theta <= 0.0f) theta += 2.0f * pi;                              // 相位为负或零时按已核对写法执行回卷
}

