lululu-913/F280049_AC-DC-AC_26competition/controller.c
//******************* PID1：母线电压外环 *******************//
void PID1_Init(void)                                                        // 初始化母线电压外环参数
{
    pid1.Xin = 0;                                                           // 初始化或更新控制器测量输入
    pid1.ref = U_BUS_REF;                                                   // 初始化母线电压外环参考值
    pid1.Err = 0;                                                           // 计算或清零当前控制误差
    pid1.Err_last = 0;                                                      // 保存或清零上一拍误差
    pid1.Kp = 0.03f;                                                        // 仿照单极性程序设置母线电压外环比例系数
    pid1.Ki = 0.001f;                                                       // 仿照单极性程序设置母线电压外环积分系数
    pid1.Kd = 0;                                                            // 设置微分系数
    pid1.result = 0;                                                        // 计算或清零控制器当前输出
    pid1.result_last = 0;                                                   // 保存或清零控制器上一拍输出
    pid1.Integral = 0;                                                      // 更新或清零控制器积分状态
}

float PID1_Cal(float u)                                                     // 计算母线电压外环增量
{
    pid1.Xin = u;                                                           // 初始化或更新控制器测量输入
    pid1.Err = pid1.ref - pid1.Xin;                                         // 母线欠压时产生正误差并提高输入电流幅值
    pid1.result = pid1.Kp * (pid1.Err - pid1.Err_last) + pid1.Ki * pid1.Err; // 计算或清零控制器当前输出
    pid1.Err_last = pid1.Err;                                               // 保存或清零上一拍误差
    pid1.result_last = pid1.result;                                         // 保存或清零控制器上一拍输出
    return pid1.result;                                                     // 返回母线电压外环增量
}

//******************* PID2：输入电流内环 *******************//
void PID2_Init(void)                                                        // 初始化输入电流内环参数
{
    pid2.Xin = 0;                                                           // 初始化或更新控制器测量输入
    pid2.ref = I_REF;                                                       // 初始化控制器参考值
    pid2.Err = 0;                                                           // 计算或清零当前控制误差
    pid2.Err_last = 0;                                                      // 保存或清零上一拍误差
    pid2.Kp = 10.0f;                                                        // 设置20kHz输入电流内环比例系数初值
    pid2.Ki = 0.05f;                                                        // 设置20kHz输入电流内环积分系数初值
    pid2.Kd = 0;                                                            // 设置微分系数
    pid2.result = 0;                                                        // 计算或清零控制器当前输出
    pid2.result_last = 0;                                                   // 保存或清零控制器上一拍输出
    pid2.Integral = 0;                                                      // 更新或清零控制器积分状态
}

float PID2_Cal(float u)                                                     // 计算输入电流内环输出
{
    pid2.Xin = u;                                                           // 初始化或更新控制器测量输入
    pid2.Err = pid2.ref - pid2.Xin;                                         // 计算或清零当前控制误差
    pid2.Integral += pid2.Err;                                              // 更新或清零控制器积分状态
    if(pid2.Integral >= 30.0f) pid2.Integral = 30.0f;                       // 限制电流环积分上限，使积分补偿不超过约1.5V
    else if(pid2.Integral <= -30.0f) pid2.Integral = -30.0f;                // 限制电流环积分下限，使积分补偿不超过约1.5V

    pid2.result = pid2.Kp * pid2.Err + pid2.Ki * pid2.Integral;             // 计算或清零控制器当前输出
    pid2.Err_last = pid2.Err;                                               // 保存或清零上一拍误差
    pid2.result_last = pid2.result;                                         // 保存或清零控制器上一拍输出
    return pid2.result;                                                     // 返回输入电流内环输出
}

float PR_controla(float ixa, float kpa)                                     // 执行A相离散PR控制
{
    in0a = ixa;                                                             // 装入PR控制器当前输入
    out0a = b0 * in0a + b2 * in2a - a1 * out1a - a2 * out2a;                // 计算PR谐振器当前输出
    out2a = out1a;                                                          // 将上一拍输出移入两拍前状态
    out1a = out0a;                                                          // 保存PR当前输出供下一拍使用
    in2a = in1a;                                                            // 将上一拍输入移入两拍前状态
    in1a = in0a;                                                            // 保存PR当前输入供下一拍使用
    y1 = kpa * in0a + out0a;                                                // 叠加比例项与谐振项
    return y1;                                                              // 返回PR控制器合成输出
}

static void SVPWM_Calculate(float phase_a, float phase_b, float phase_c,     // 使用最大最小值共模注入法计算线性区SVPWM
                            float modulation, float *duty_a,
                            float *duty_b, float *duty_c)
{
    float ref_a = modulation * sinf(phase_a);                               // 生成保持原有幅值标定的A相基波参考
    float ref_b = modulation * sinf(phase_b);                               // 生成保持当前B相超前120度的基波参考
    float ref_c = modulation * sinf(phase_c);                               // 生成保持当前C相滞后120度的基波参考
    float sv_max = ref_a;                                                    // 初始化三相参考最大值
    float sv_min = ref_a;                                                    // 初始化三相参考最小值
    float sv_offset;                                                         // 保存SVPWM零序共模偏置

    if(ref_b > sv_max) sv_max = ref_b;                                      // 更新三相参考最大值
    if(ref_c > sv_max) sv_max = ref_c;                                      // 更新三相参考最大值
    if(ref_b < sv_min) sv_min = ref_b;                                      // 更新三相参考最小值
    if(ref_c < sv_min) sv_min = ref_c;                                      // 更新三相参考最小值

    sv_offset = -0.5f * (sv_max + sv_min);                                  // 居中有效矢量并等分零矢量作用时间
    *duty_a = 0.5f + ref_a + sv_offset;                                     // 叠加共模偏置得到A相占空比
    *duty_b = 0.5f + ref_b + sv_offset;                                     // 叠加共模偏置得到B相占空比
    *duty_c = 0.5f + ref_c + sv_offset;                                     // 叠加共模偏置得到C相占空比

    if(*duty_a > 1.0f) *duty_a = 1.0f;                                     // 防止异常调制度导致A相比较值越界
    else if(*duty_a < 0.0f) *duty_a = 0.0f;                                // 防止异常调制度导致A相比较值越界
    if(*duty_b > 1.0f) *duty_b = 1.0f;                                     // 防止异常调制度导致B相比较值越界
    else if(*duty_b < 0.0f) *duty_b = 0.0f;                                // 防止异常调制度导致B相比较值越界
    if(*duty_c > 1.0f) *duty_c = 1.0f;                                     // 防止异常调制度导致C相比较值越界
    else if(*duty_c < 0.0f) *duty_c = 0.0f;                                // 防止异常调制度导致C相比较值越界
}

