lululu-913/F280049_AC-DC-AC_26competition/controller.c
//******************* PIDa：三相输出电压环 *******************//
void PIDa_Init(void)                                                        // 初始化逆变输出电压控制参数
{
    pida.Xin = 0;                                                           // 初始化或更新控制器测量输入
    pida.ref = 0;                                                           // 初始化控制器参考值
    pida.Err = 0;                                                           // 计算或清零当前控制误差
    pida.Err_last = 0;                                                      // 保存或清零上一拍误差
    pida.Kp = 0.01;                                                         // 设置比例系数
    pida.Ki = 0.005;                                                        // 设置积分系数
    pida.Kd = 0;                                                            // 设置微分系数
    pida.result = 0;                                                        // 计算或清零控制器当前输出
    pida.result_last = 0;                                                   // 保存或清零控制器上一拍输出
    pida.Integral = 0;                                                      // 更新或清零控制器积分状态
}

float PIDa_Cal(float u)                                                     // 计算逆变调制分母增量
{
    pida.Xin = u;                                                           // 初始化或更新控制器测量输入
    pida.Err = pida.Xin - pida.ref;                                         // 计算或清零当前控制误差
    pida.result = pida.Kp * (pida.Err - pida.Err_last) + pida.Ki * pida.Err; // 计算或清零控制器当前输出
    pida.Err_last = pida.Err;                                               // 保存或清零上一拍误差
    pida.result_last = pida.result;                                         // 保存或清零控制器上一拍输出
    if(fabsf(pida.Err) > 0.01f) return pida.result;                         // 输出误差超出死区时返回调节增量
    return 0;                                                               // 误差位于死区时返回零增量
}

//******************* PIDc：保留控制器 *******************//
void PIDc_Init(void)                                                        // 初始化备用PID参数
{
    pidc.Xin = 0;                                                           // 初始化或更新控制器测量输入
    pidc.ref = 0;                                                           // 初始化控制器参考值
    pidc.Err = 0;                                                           // 计算或清零当前控制误差
    pidc.Err_last = 0;                                                      // 保存或清零上一拍误差
    pidc.Kp = 0.001;                                                        // 设置比例系数
    pidc.Ki = 0.00001;                                                      // 设置积分系数
    pidc.Kd = 0;                                                            // 设置微分系数
    pidc.result = 0;                                                        // 计算或清零控制器当前输出
    pidc.result_last = 0;                                                   // 保存或清零控制器上一拍输出
    pidc.Integral = 0;                                                      // 更新或清零控制器积分状态
}

float PIDc_Cal(float u)                                                     // 计算备用PID输出
{
    pidc.Xin = u;                                                           // 初始化或更新控制器测量输入
    pidc.Err = pidc.ref - pidc.Xin;                                         // 计算或清零当前控制误差
    pidc.result = pidc.Kp * (pidc.Err - pidc.Err_last) + pidc.Ki * pidc.Err + pidc.result_last; // 计算或清零控制器当前输出
    pidc.Err_last = pidc.Err;                                               // 保存或清零上一拍误差
    pidc.result_last = pidc.result;                                         // 保存或清零控制器上一拍输出
    if(fabsf(pidc.Err) > 0.01f) return pidc.result;                         // 备用控制器误差超出死区时返回输出
    return 0;                                                               // 误差位于死区时返回零增量
}

//******************* OLED显示 *******************//
void OLED_output(void)                                                      // 刷新设定值和测量值显示
{
    float oled_bus_value;                                                   // 保存本次刷新使用的实时母线电压快照
    float oled_out_value;                                                   // 保存本次刷新使用的三相输出电压快照
    float oled_di_value;                                                    // 保存本次刷新使用的整流调制量快照
    DINT;                                                                   // 短暂屏蔽ISR，保证三个32位浮点快照内部一致
    oled_bus_value = U_bus;                                                 // 获取实时母线电压供全部模式统一显示
    oled_out_value = U_av;                                                  // 获取实时三相输出等效相电压供全部模式统一显示
    oled_di_value = Di;                                                     // 只读取一次Di，避免符号和幅值来自不同控制周期
    EINT;                                                                   // 快照完成后立即恢复控制中断
    if(oled_bus_value < 0.0f) oled_bus_value = 0.0f;                        // 钳除零点偏差产生的负母线显示值
    if(oled_out_value < 0.0f) oled_out_value = 0.0f;                        // 防止异常负数进入不支持负数的OLED浮点函数
    if(oled_bus_value > 99.0f) oled_bus_value = 99.0f;                      // 限制显示范围以避免超过固定字符区域
    if(oled_out_value > 99.0f) oled_out_value = 99.0f;                      // 限制输出显示范围以保持四行布局稳定

    switch(oled_row)                                                        // 每次调用只刷新一行以降低后台OLED通信占用
    {
        case 0:                                                             // 第0行分别显示整流命令、逆变命令、故障和调制分母
            OLED_ShowNum(1, 0, rectifier_enable, 1);                        // R后显示主动整流命令0或1
            OLED_ShowNum(4, 0, inverter_enable, 1);                         // I后显示逆变运行命令0或1
            OLED_ShowNum(7, 0, flag, 1);                                    // F后显示当前故障码0、1或2
            OLED_ShowFloat(10, 0, M, 3);                                    // M后显示逆变当前调制分母
            break;                                                          // 本次单行刷新结束

        case 1:                                                             // 第1行显示母线参考和母线实测值
            OLED_ShowFloat(3, 1, U_BUS_REF, 3);                             // BR后显示母线电压参考值
            OLED_ShowFloat(10, 1, oled_bus_value, 3);                       // B后显示当前母线实时采样值
            break;                                                          // 本次单行刷新结束

        case 2:                                                             // 第2行显示输出参考和输出实测值
            OLED_ShowFloat(3, 2, U_OUT_REF, 3);                             // OR后显示三相输出相电压参考值
            OLED_ShowFloat(10, 2, oled_out_value, 3);                       // O后显示当前三相输出等效相电压
            break;                                                          // 本次单行刷新结束

        default:                                                            // 第3行显示逆变输出频率命令和带符号的整流调制量
            OLED_ShowNum(1, 3, output_freq_hz, 4);                          // F后以整数显示45～505Hz频率命令
            OLED_ShowChar(10, 3, (oled_di_value < 0.0f) ? '-' : '+');       // DI后显式显示整流差模调制量快照符号
            OLED_ShowFloat(11, 3, fabsf(oled_di_value), 3);                 // 符号后显示同一快照的0～0.95幅值
            break;                                                          // 本次单行刷新结束
    }

    oled_row++;                                                             // 下一次刷新下一行
    if(oled_row >= 4) oled_row = 0;                                         // 第3行完成后回到第0行循环刷新
}

//******************* 按键控制 *******************//
void KEY_Control(int key_value)                                             // 根据按键修改模式或参考值
{
    switch(key_value)                                                       // 根据按键码选择对应操作
    {
        case KEY1_PRESS:                                                    // KEY1固定增加三相逆变输出频率
            if(output_freq_hz < OUTPUT_FREQ_MAX_HZ)                         // 已到505Hz上限时保持不变
                output_freq_hz += OUTPUT_FREQ_STEP_HZ;                      // 每次扫描事件把输出频率增加1Hz
            break;                                                          // 结束当前按键分支

