lululu-913/F280049_AC-DC-AC_26competition/controller.c
        case KEY2_PRESS:                                                    // KEY2固定减小三相逆变输出频率
            if(output_freq_hz > OUTPUT_FREQ_MIN_HZ)                         // 已到45Hz下限时保持不变
                output_freq_hz -= OUTPUT_FREQ_STEP_HZ;                      // 每次扫描事件把输出频率减小1Hz
            break;                                                          // 结束当前按键分支

        case KEY3_PRESS:                                                    // KEY3切换主动整流，并联锁保证逆变先启动
            if(rectifier_enable == 0)                                       // 当前处于被动整流或整流Trip状态
            {
                if(U_bus < BUS_OVERVOLTAGE_LIMIT)                           // 母线已经退出过压区才允许重新确认启动
                {
                    system_fault = 0;                                       // 同时清除可能存在的预留全局故障锁存
                    rectifier_fault = 0;                                    // 清除整流局部故障锁存
                    inverter_enable = 1;                                    // KEY3同时保证先提出逆变运行请求
                    rectifier_enable = 1;                                   // 请求整流等待逆变PWM正常后再启动ePWM4/5
                    flag = 0;                                               // 清除旧故障显示
                }
            }
            else                                                            // 当前主动整流已经处于开启请求
            {
                rectifier_enable = 0;                                       // 撤销主动整流命令但不改变逆变命令
                rectifier_pwm_start_stage = 0;                              // 下次KEY3开启时重新执行CMPA预装
                PWM_TripRectifier();                                        // 本次按键处理当拍立即Trip ePWM4/5
            }
            break;                                                          // 结束当前按键分支

        case KEY4_PRESS:                                                    // KEY4固定增加逆变侧输出相电压目标值
            U_OUT_REF += 0.5f;                                              // 每次扫描事件把逆变输出目标增加0.5V
            break;                                                          // 结束当前按键分支

        case KEY5_PRESS:                                                    // KEY5固定减小逆变侧输出相电压目标值
            U_OUT_REF -= 0.5f;                                              // 每次扫描事件把逆变输出目标减小0.5V
            break;                                                          // 结束当前按键分支

        case KEY6_PRESS:                                                    // KEY6切换三相逆变，关断时先停止主动整流
            if(inverter_enable == 0)                                        // 当前逆变侧没有运行请求
            {
                if(U_bus < BUS_OVERVOLTAGE_LIMIT)                           // 母线已经退出过压区才接受新的逆变运行请求
                {
                    system_fault = 0;                                       // 清除可能存在的预留全局故障锁存
                    inverter_enable = 1;                                    // 请求逆变立即进入PWM预装和软启动流程
                }
            }
            else                                                            // 当前逆变侧已有运行请求
            {
                if(rectifier_enable != 0)                                   // 主动整流仍有运行请求时必须先停止整流
                {
                    rectifier_enable = 0;                                   // 撤销主动整流命令
                    rectifier_pwm_start_stage = 0;                          // 清零整流PWM启动阶段
                    PWM_TripRectifier();                                    // 立即Trip ePWM4/5，确保整流先于逆变关断
                }
                inverter_enable = 0;                                        // 撤销逆变运行命令并由控制ISR执行软关断
            }
            break;                                                          // 结束当前按键分支

        case KEY_UNPRESS:                                                   // 无按键时不执行操作
        default:                                                            // 未定义按键码同样不执行操作
            break;                                                          // 结束当前按键分支
    }
    tag = ((rectifier_enable != 0) ? 2 : 0) + ((inverter_enable != 0) ? 1 : 0); // 组合状态仅供在线观察，不参与任一控制条件
}

char KEY_Scan(char key_mode)                                                // 仿照07192140工程读取六个低电平有效按键
{
    static int key3_latched = 0;                                            // KEY3按下后锁存一次，必须检测到松开才允许再次切换模式
    static int key6_latched = 0;                                            // KEY6按下后锁存一次，防止长按反复启停逆变
    if(KEY_H3 != 0) key3_latched = 0;                                       // KEY3松开后解除锁存，重新允许下一次按下事件
    if(KEY_H6 != 0) key6_latched = 0;                                       // KEY6松开后解除锁存，重新允许下一次按下事件

    if(key_mode == 0)                                                       // 当前调用使用模式0时依次检测六个按键
    {
        if((KEY_H3 == 0) && (key3_latched == 0))                            // KEY3本次按下尚未产生过模式切换事件
        {
            key3_latched = 1;                                               // 锁存本次按下，防止长按反复启停主动整流
            return KEY3_PRESS;                                              // 每次完整按下与松开过程只返回一次KEY3事件
        }
        if(KEY_H4 == 0) return KEY4_PRESS;                                  // 长按KEY4时保持每500ms重复一次升压事件
        if(KEY_H5 == 0) return KEY5_PRESS;                                  // 长按KEY5时保持每500ms重复一次降压事件
        if((KEY_H6 == 0) && (key6_latched == 0))                            // KEY6本次按下尚未产生过逆变模式切换
        {
            key6_latched = 1;                                               // 锁存本次KEY6按下直到检测到松开
            return KEY6_PRESS;                                              // 每次完整按下与松开过程只返回一次KEY6事件
        }
    }
    return KEY_UNPRESS;                                                     // 未检测到按键时返回未按下状态
}

void Init_KEY(void)                                                         // 配置目标板六个按键输入
{
    EALLOW;                                                                 // 允许访问受保护寄存器

    GPIO_setPadConfig(27, GPIO_PIN_TYPE_STD);                               // 配置对应按键GPIO为标准数字输入焊盘
    GPIO_setDirectionMode(27, GPIO_DIR_MODE_IN);                            // 配置对应按键GPIO为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO27 = 0;                                     // 使能对应按键GPIO内部上拉

    GPIO_setPadConfig(25, GPIO_PIN_TYPE_STD);                               // 配置对应按键GPIO为标准数字输入焊盘
    GPIO_setDirectionMode(25, GPIO_DIR_MODE_IN);                            // 配置对应按键GPIO为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO25 = 0;                                     // 使能对应按键GPIO内部上拉

    GPIO_setPadConfig(17, GPIO_PIN_TYPE_STD);                               // 配置对应按键GPIO为标准数字输入焊盘
    GPIO_setDirectionMode(17, GPIO_DIR_MODE_IN);                            // 配置对应按键GPIO为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO17 = 0;                                     // 使能对应按键GPIO内部上拉

    GPIO_setPadConfig(26, GPIO_PIN_TYPE_STD);                               // 配置对应按键GPIO为标准数字输入焊盘
    GPIO_setDirectionMode(26, GPIO_DIR_MODE_IN);                            // 配置对应按键GPIO为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO26 = 0;                                     // 使能对应按键GPIO内部上拉

    GPIO_setAnalogMode(16, GPIO_ANALOG_DISABLED);                           // 参考07192140工程关闭GPIO16模拟功能供KEY5使用
    GPIO_setPadConfig(16, GPIO_PIN_TYPE_STD);                               // 配置KEY5对应GPIO16为标准数字输入焊盘
    GPIO_setDirectionMode(16, GPIO_DIR_MODE_IN);                            // 配置KEY5对应GPIO16为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO16 = 0;                                     // 使能KEY5对应GPIO16内部上拉

