lululu-913/F280049_AC-DC-AC_26competition/controller.c
    GPIO_setAnalogMode(39, GPIO_ANALOG_DISABLED);                           // 参考07192140工程关闭GPIO39模拟功能供KEY6使用
    GPIO_setPadConfig(39, GPIO_PIN_TYPE_STD);                               // 配置KEY6对应GPIO39为标准数字输入焊盘
    GPIO_setDirectionMode(39, GPIO_DIR_MODE_IN);                            // 配置KEY6对应GPIO39为输入方向
    GpioCtrlRegs.GPBPUD.bit.GPIO39 = 0;                                     // 使能KEY6对应GPIO39内部上拉

    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

//******************* 保留自2025源码、当前未启用的ePWM1中断 *******************//
__interrupt void epwm1_isr(void)                                            // 保留的ePWM1中断服务函数
{
    EPwm1Regs.ETCLR.bit.INT = 1;                                            // 清除ePWM1中断标志
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;                                 // 应答PIE第3组中断
}

//******************* PWM安全控制辅助函数 *******************//
static void PWM_ForceAllLow(void)                                           // 将六组ePWM的A/B输出强制拉低
{
    EALLOW;                                                                 // 允许访问受保护的Trip Zone软件触发寄存器
    EPwm1Regs.TZFRC.bit.OST = 1;                                            // 从死区模块之后立即锁存关断逆变A相A/B输出
    EPwm2Regs.TZFRC.bit.OST = 1;                                            // 从死区模块之后立即锁存关断逆变B相A/B输出
    EPwm3Regs.TZFRC.bit.OST = 1;                                            // 从死区模块之后立即锁存关断逆变C相A/B输出
    EPwm4Regs.TZFRC.bit.OST = 1;                                            // 从死区模块之后立即锁存关断整流左桥臂A/B输出
    EPwm5Regs.TZFRC.bit.OST = 1;                                            // 从死区模块之后立即锁存关断整流右桥臂A/B输出
    EPwm6Regs.TZFRC.bit.OST = 1;                                            // 锁存关断未使用的ePWM6 A/B输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

static void PWM_TripInverter(void)                                          // 只关断逆变侧ePWM1～3并保持整流侧当前状态
{
    EALLOW;                                                                 // 允许访问逆变侧Trip Zone软件触发寄存器
    EPwm1Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断逆变A相A/B输出
    EPwm2Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断逆变B相A/B输出
    EPwm3Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断逆变C相A/B输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

static void PWM_TripRectifier(void)                                         // 只关断整流侧ePWM4/5并保持逆变侧当前状态
{
    EALLOW;                                                                 // 允许访问整流侧Trip Zone软件触发寄存器
    EPwm4Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断整流左桥臂A/B输出
    EPwm5Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断整流右桥臂A/B输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

static void PWM_ReleaseInverter(void)                                       // 按逆变独立启动阶段释放ePWM1～3
{
    EALLOW;                                                                 // 允许访问逆变侧Trip Zone清除与软件触发寄存器
    if(inverter_pwm_start_stage == 1)                                       // 第一拍仅把三相计算值写入CMPA影子寄存器
    {
        inverter_pwm_start_stage = 2;                                       // 等待下一次TBCTR归零装载新的三相CMPA
    }
    else if(inverter_pwm_start_stage == 2)                                  // 第二拍ISR到来时CMPA活动值已经完成装载
    {
        EPwm1Regs.TZCLR.bit.OST = 1;                                        // 解除逆变A相One-Shot Trip关断锁存
        EPwm2Regs.TZCLR.bit.OST = 1;                                        // 解除逆变B相One-Shot Trip关断锁存
        EPwm3Regs.TZCLR.bit.OST = 1;                                        // 解除逆变C相One-Shot Trip关断锁存
        inverter_pwm_start_stage = 3;                                       // 标记三相逆变PWM已经进入正常运行阶段
    }
    else if(inverter_pwm_start_stage != 3)                                  // 非法阶段值下不允许逆变桥输出
    {
        EPwm1Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持逆变A相关断
        EPwm2Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持逆变B相关断
        EPwm3Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持逆变C相关断
    }
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

static void PWM_ReleaseRectifier(void)                                      // 按整流独立启动阶段释放ePWM4/5
{
    EALLOW;                                                                 // 允许访问整流侧Trip Zone清除与软件触发寄存器
    if(rectifier_pwm_start_stage == 1)                                      // 第一拍仅把整流计算值写入CMPA影子寄存器
    {
        rectifier_pwm_start_stage = 2;                                      // 等待下一次TBCTR归零装载ePWM4/5比较值
    }
    else if(rectifier_pwm_start_stage == 2)                                 // 第二拍ISR到来时整流CMPA已经完成装载
    {
        EPwm4Regs.TZCLR.bit.OST = 1;                                        // 解除整流左桥臂One-Shot Trip关断锁存
        EPwm5Regs.TZCLR.bit.OST = 1;                                        // 解除整流右桥臂One-Shot Trip关断锁存
        rectifier_pwm_start_stage = 3;                                      // 标记主动整流PWM已经进入正常运行阶段
    }
    else if(rectifier_pwm_start_stage != 3)                                 // 非法阶段值下不允许主动整流输出
    {
        EPwm4Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持整流左桥臂关断
        EPwm5Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持整流右桥臂关断
    }
    EPwm6Regs.TZFRC.bit.OST = 1;                                            // ePWM6在全部模式下始终保持Trip关断
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

//******************* ePWM统一初始化 *******************//
void InitEPWM(void)                                                         // 冻结时基并统一配置所有ePWM模块
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 0;                                   // 冻结全部ePWM时基以便同步配置
    EDIS;                                                                   // 重新禁止访问受保护寄存器

    EPWM1_Init();                                                           // 配置三相逆变A相ePWM
    EPWM2_Init();                                                           // 配置三相逆变B相ePWM
    EPWM3_Init();                                                           // 配置三相逆变C相ePWM及ADC触发
    EPWM4_Init();                                                           // 配置单相整流左桥臂ePWM
    EPWM5_Init();                                                           // 配置单相整流右桥臂ePWM
    EPWM6_Init();                                                           // 配置未使用的ePWM6并保持关断
    PWM_ForceAllLow();                                                      // 立即将所有ePWM输出强制为低电平
}

void EPWM1_Init(void)                                                       // 初始化ePWM1
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR2.bit.EPWM1 = 1;                                       // 打开对应ePWM模块外设时钟
    EPwm1Regs.TZCTL.bit.TZA = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM1A为低
    EPwm1Regs.TZCTL.bit.TZB = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM1B为低
    EPwm1Regs.TZFRC.bit.OST = 1;                                            // 初始化期间立即锁存关断ePWM1输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    EPwm1Regs.AQSFRC.bit.RLDCSF = 3;                                        // AQ连续软件强制使用立即模式，仅用于清除可能残留的旧状态
    EPwm1Regs.AQCSFRC.bit.CSFA = 0;                                         // 禁用旧的ePWM1A AQ连续软件强制
    EPwm1Regs.AQCSFRC.bit.CSFB = 0;                                         // 禁用旧的ePWM1B AQ连续软件强制

