lululu-913/F280049_AC-DC-AC_26competition/controller.c
    EPwm1Regs.TBCTL.bit.SYNCOSEL = TB_CTR_ZERO;                             // 选择该ePWM的同步输出来源
    EPwm1Regs.TBCTL.bit.PHSEN = TB_DISABLE;                                 // 配置相位同步装载功能
    EPwm1Regs.TBPHS.all = 0;                                                // 将同步相位偏移清零
    EPwm1Regs.TBCTR = 0;                                                    // 将时基计数器清零
    EPwm1Regs.TBPRD = EPWM_TIMER_TBPRD;                                     // 设置中心对齐PWM周期值
    EPwm1Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;                          // 采用上下计数的中心对齐模式
    EPwm1Regs.TBCTL.bit.HSPCLKDIV = TB_DIV1;                                // 高速时基时钟不分频
    EPwm1Regs.TBCTL.bit.CLKDIV = TB_DIV1;                                   // 时基时钟不分频
    EPwm1Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;                             // 使能CMPA影子寄存器
    EPwm1Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;                             // 使能CMPB影子寄存器
    EPwm1Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPA
    EPwm1Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPB
    EPwm1Regs.CMPA.bit.CMPA = 0;                                            // 设置A路比较值
    EPwm1Regs.AQCTLA.bit.ZRO = AQ_SET;                                      // 计数器归零时将A路输出置高
    EPwm1Regs.AQCTLA.bit.CAU = AQ_CLEAR;                                    // 上数到CMPA时将A路输出清低
    EPwm1Regs.AQCTLA.bit.CAD = AQ_SET;                                      // 下数到CMPA时将A路输出置高
    EPwm1Regs.AQCTLB.bit.ZRO = AQ_SET;                                      // 计数器归零时将B路原始输出置高
    EPwm1Regs.AQCTLB.bit.CBU = AQ_CLEAR;                                    // 上数到CMPB时将B路原始输出清低
    EPwm1Regs.AQCTLB.bit.CBD = AQ_SET;                                      // 下数到CMPB时将B路原始输出置高
    EPwm1Regs.DBCTL.bit.IN_MODE = 0;                                        // 选择ePWM A作为死区双沿输入
    EPwm1Regs.DBCTL.bit.POLSEL = 2;                                         // 设置互补输出极性
    EPwm1Regs.DBCTL.bit.OUT_MODE = 3;                                       // 同时使能上升沿和下降沿死区
    EPwm1Regs.DBRED.bit.DBRED = 15;                                         // 设置上升沿死区为15个TBCLK
    EPwm1Regs.DBFED.bit.DBFED = 15;                                         // 设置下降沿死区为15个TBCLK
    EPwm1Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;                               // 选择计数器归零作为ePWM中断事件
    EPwm1Regs.ETSEL.bit.INTEN = 0;                                          // 关闭未使用的ePWM中断请求
    EPwm1Regs.ETPS.bit.INTPRD = ET_1ST;                                     // 配置每次事件产生一次中断标志
}

void EPWM2_Init(void)                                                       // 初始化ePWM2
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR2.bit.EPWM2 = 1;                                       // 打开对应ePWM模块外设时钟
    EPwm2Regs.TZCTL.bit.TZA = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM2A为低
    EPwm2Regs.TZCTL.bit.TZB = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM2B为低
    EPwm2Regs.TZFRC.bit.OST = 1;                                            // 初始化期间立即锁存关断ePWM2输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    EPwm2Regs.AQSFRC.bit.RLDCSF = 3;                                        // AQ连续软件强制使用立即模式，仅用于清除可能残留的旧状态
    EPwm2Regs.AQCSFRC.bit.CSFA = 0;                                         // 禁用旧的ePWM2A AQ连续软件强制
    EPwm2Regs.AQCSFRC.bit.CSFB = 0;                                         // 禁用旧的ePWM2B AQ连续软件强制

    EPwm2Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;                              // 选择该ePWM的同步输出来源
    EPwm2Regs.TBCTL.bit.PHSEN = TB_ENABLE;                                  // 配置相位同步装载功能
    EPwm2Regs.TBPHS.all = 0;                                                // 将同步相位偏移清零
    EPwm2Regs.TBCTR = 0;                                                    // 将时基计数器清零
    EPwm2Regs.TBPRD = EPWM_TIMER_TBPRD;                                     // 设置中心对齐PWM周期值
    EPwm2Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;                          // 采用上下计数的中心对齐模式
    EPwm2Regs.TBCTL.bit.HSPCLKDIV = TB_DIV1;                                // 高速时基时钟不分频
    EPwm2Regs.TBCTL.bit.CLKDIV = TB_DIV1;                                   // 时基时钟不分频
    EPwm2Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;                             // 使能CMPA影子寄存器
    EPwm2Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;                             // 使能CMPB影子寄存器
    EPwm2Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPA
    EPwm2Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPB
    EPwm2Regs.CMPA.bit.CMPA = 0;                                            // 设置A路比较值
    EPwm2Regs.AQCTLA.bit.ZRO = AQ_SET;                                      // 计数器归零时将A路输出置高
    EPwm2Regs.AQCTLA.bit.CAU = AQ_CLEAR;                                    // 上数到CMPA时将A路输出清低
    EPwm2Regs.AQCTLA.bit.CAD = AQ_SET;                                      // 下数到CMPA时将A路输出置高
    EPwm2Regs.AQCTLB.bit.ZRO = AQ_SET;                                      // 计数器归零时将B路原始输出置高
    EPwm2Regs.AQCTLB.bit.CBU = AQ_CLEAR;                                    // 上数到CMPB时将B路原始输出清低
    EPwm2Regs.AQCTLB.bit.CBD = AQ_SET;                                      // 下数到CMPB时将B路原始输出置高
    EPwm2Regs.DBCTL.bit.IN_MODE = 0;                                        // 选择ePWM A作为死区双沿输入
    EPwm2Regs.DBCTL.bit.POLSEL = 2;                                         // 设置互补输出极性
    EPwm2Regs.DBCTL.bit.OUT_MODE = 3;                                       // 同时使能上升沿和下降沿死区
    EPwm2Regs.DBRED.bit.DBRED = 15;                                         // 设置上升沿死区为15个TBCLK
    EPwm2Regs.DBFED.bit.DBFED = 15;                                         // 设置下降沿死区为15个TBCLK
    EPwm2Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;                               // 选择计数器归零作为ePWM中断事件
    EPwm2Regs.ETSEL.bit.INTEN = 0;                                          // 关闭未使用的ePWM中断请求
    EPwm2Regs.ETPS.bit.INTPRD = ET_1ST;                                     // 配置每次事件产生一次中断标志
}

void EPWM3_Init(void)                                                       // 初始化ePWM3及SOCA触发
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR2.bit.EPWM3 = 1;                                       // 打开对应ePWM模块外设时钟
    EPwm3Regs.TZCTL.bit.TZA = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM3A为低
    EPwm3Regs.TZCTL.bit.TZB = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM3B为低
    EPwm3Regs.TZFRC.bit.OST = 1;                                            // 初始化期间立即锁存关断ePWM3输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    EPwm3Regs.AQSFRC.bit.RLDCSF = 3;                                        // AQ连续软件强制使用立即模式，仅用于清除可能残留的旧状态
    EPwm3Regs.AQCSFRC.bit.CSFA = 0;                                         // 禁用旧的ePWM3A AQ连续软件强制
    EPwm3Regs.AQCSFRC.bit.CSFB = 0;                                         // 禁用旧的ePWM3B AQ连续软件强制

