lululu-913/F280049_AC-DC-AC_26competition/controller.c
    EPwm3Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;                              // 选择该ePWM的同步输出来源
    EPwm3Regs.TBCTL.bit.PHSEN = TB_ENABLE;                                  // 配置相位同步装载功能
    EPwm3Regs.TBPHS.all = 0;                                                // 将同步相位偏移清零
    EPwm3Regs.TBCTR = 0;                                                    // 将时基计数器清零
    EPwm3Regs.TBPRD = EPWM_TIMER_TBPRD;                                     // 设置中心对齐PWM周期值
    EPwm3Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;                          // 采用上下计数的中心对齐模式
    EPwm3Regs.TBCTL.bit.HSPCLKDIV = TB_DIV1;                                // 高速时基时钟不分频
    EPwm3Regs.TBCTL.bit.CLKDIV = TB_DIV1;                                   // 时基时钟不分频
    EPwm3Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;                             // 使能CMPA影子寄存器
    EPwm3Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;                             // 使能CMPB影子寄存器
    EPwm3Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPA
    EPwm3Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPB
    EPwm3Regs.CMPA.bit.CMPA = 0;                                            // 设置A路比较值
    EPwm3Regs.AQCTLA.bit.ZRO = AQ_SET;                                      // 计数器归零时将A路输出置高
    EPwm3Regs.AQCTLA.bit.CAU = AQ_CLEAR;                                    // 上数到CMPA时将A路输出清低
    EPwm3Regs.AQCTLA.bit.CAD = AQ_SET;                                      // 下数到CMPA时将A路输出置高
    EPwm3Regs.AQCTLB.bit.ZRO = AQ_SET;                                      // 计数器归零时将B路原始输出置高
    EPwm3Regs.AQCTLB.bit.CBU = AQ_CLEAR;                                    // 上数到CMPB时将B路原始输出清低
    EPwm3Regs.AQCTLB.bit.CBD = AQ_SET;                                      // 下数到CMPB时将B路原始输出置高
    EPwm3Regs.DBCTL.bit.IN_MODE = 0;                                        // 选择ePWM A作为死区双沿输入
    EPwm3Regs.DBCTL.bit.POLSEL = 2;                                         // 设置互补输出极性
    EPwm3Regs.DBCTL.bit.OUT_MODE = 3;                                       // 同时使能上升沿和下降沿死区
    EPwm3Regs.DBRED.bit.DBRED = 15;                                         // 设置上升沿死区为15个TBCLK
    EPwm3Regs.DBFED.bit.DBFED = 15;                                         // 设置下降沿死区为15个TBCLK
    EPwm3Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;                               // 选择计数器归零作为ePWM中断事件
    EPwm3Regs.ETSEL.bit.INTEN = 0;                                          // 关闭未使用的ePWM中断请求
    EPwm3Regs.ETPS.bit.INTPRD = ET_1ST;                                     // 配置每次事件产生一次中断标志
    EPwm3Regs.ETSEL.bit.SOCAEN = 1;                                         // 使能ePWM3的ADC启动脉冲
    EPwm3Regs.ETSEL.bit.SOCASEL = 1;                                        // 选择TBCTR等于零作为ADC采样时刻
    EPwm3Regs.ETPS.bit.SOCAPRD = 1;                                         // 每次采样事件都产生SOCA
}

void EPWM4_Init(void)                                                       // 初始化整流左桥臂ePWM4
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR2.bit.EPWM4 = 1;                                       // 打开对应ePWM模块外设时钟
    EPwm4Regs.TZCTL.bit.TZA = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM4A为低
    EPwm4Regs.TZCTL.bit.TZB = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM4B为低
    EPwm4Regs.TZFRC.bit.OST = 1;                                            // 初始化期间立即锁存关断ePWM4输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    EPwm4Regs.AQSFRC.bit.RLDCSF = 3;                                        // AQ连续软件强制使用立即模式，仅用于清除可能残留的旧状态
    EPwm4Regs.AQCSFRC.bit.CSFA = 0;                                         // 禁用旧的ePWM4A AQ连续软件强制
    EPwm4Regs.AQCSFRC.bit.CSFB = 0;                                         // 禁用旧的ePWM4B AQ连续软件强制

    EPwm4Regs.TBCTL.bit.SYNCOSEL = TB_CTR_ZERO;                             // 选择该ePWM的同步输出来源
    EPwm4Regs.TBCTL.bit.PHSEN = TB_DISABLE;                                 // 配置相位同步装载功能
    EPwm4Regs.TBPHS.all = 0;                                                // 将同步相位偏移清零
    EPwm4Regs.TBCTR = 0;                                                    // 将时基计数器清零
    EPwm4Regs.TBPRD = EPWM_TIMER_TBPRD;                                     // 设置中心对齐PWM周期值
    EPwm4Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;                          // 采用上下计数的中心对齐模式
    EPwm4Regs.TBCTL.bit.HSPCLKDIV = TB_DIV1;                                // 高速时基时钟不分频
    EPwm4Regs.TBCTL.bit.CLKDIV = TB_DIV1;                                   // 时基时钟不分频
    EPwm4Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;                             // 使能CMPA影子寄存器
    EPwm4Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;                             // 使能CMPB影子寄存器
    EPwm4Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPA
    EPwm4Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPB
    EPwm4Regs.CMPA.bit.CMPA = 0;                                            // 设置A路比较值
    EPwm4Regs.AQCTLA.bit.ZRO = AQ_SET;                                      // 计数器归零时将A路输出置高
    EPwm4Regs.AQCTLA.bit.CAU = AQ_CLEAR;                                    // 上数到CMPA时将A路输出清低
    EPwm4Regs.AQCTLA.bit.CAD = AQ_SET;                                      // 下数到CMPA时将A路输出置高
    EPwm4Regs.AQCTLB.bit.ZRO = AQ_SET;                                      // 计数器归零时将B路原始输出置高
    EPwm4Regs.AQCTLB.bit.CBU = AQ_CLEAR;                                    // 上数到CMPB时将B路原始输出清低
    EPwm4Regs.AQCTLB.bit.CBD = AQ_SET;                                      // 下数到CMPB时将B路原始输出置高
    EPwm4Regs.DBCTL.bit.IN_MODE = 0;                                        // 选择ePWM A作为死区双沿输入
    EPwm4Regs.DBCTL.bit.POLSEL = 2;                                         // 设置互补输出极性
    EPwm4Regs.DBCTL.bit.OUT_MODE = 3;                                       // 同时使能上升沿和下降沿死区
    EPwm4Regs.DBRED.bit.DBRED = 15;                                         // 设置上升沿死区为15个TBCLK
    EPwm4Regs.DBFED.bit.DBFED = 15;                                         // 设置下降沿死区为15个TBCLK
    EPwm4Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;                               // 选择计数器归零作为ePWM中断事件
    EPwm4Regs.ETSEL.bit.INTEN = 0;                                          // 关闭未使用的ePWM中断请求
    EPwm4Regs.ETPS.bit.INTPRD = ET_1ST;                                     // 配置每次事件产生一次中断标志
}

void EPWM5_Init(void)                                                       // 初始化整流右桥臂ePWM5
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR2.bit.EPWM5 = 1;                                       // 打开对应ePWM模块外设时钟
    EPwm5Regs.TZCTL.bit.TZA = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM5A为低
    EPwm5Regs.TZCTL.bit.TZB = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM5B为低
    EPwm5Regs.TZFRC.bit.OST = 1;                                            // 初始化期间立即锁存关断ePWM5输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    EPwm5Regs.AQSFRC.bit.RLDCSF = 3;                                        // AQ连续软件强制使用立即模式，仅用于清除可能残留的旧状态
    EPwm5Regs.AQCSFRC.bit.CSFA = 0;                                         // 禁用旧的ePWM5A AQ连续软件强制
    EPwm5Regs.AQCSFRC.bit.CSFB = 0;                                         // 禁用旧的ePWM5B AQ连续软件强制

    EPwm5Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;                              // 继续传递来自ePWM4的同步信号
    EPwm5Regs.TBCTL.bit.PHSEN = TB_ENABLE;                                  // 使能相位装载以便与ePWM4使用同相载波
    EPwm5Regs.TBPHS.all = 0;                                                // 将同步相位偏移清零
    EPwm5Regs.TBCTR = 0;                                                    // 将时基计数器清零
    EPwm5Regs.TBPRD = EPWM_TIMER_TBPRD;                                     // 设置中心对齐PWM周期值
    EPwm5Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;                          // 采用上下计数的中心对齐模式
    EPwm5Regs.TBCTL.bit.HSPCLKDIV = TB_DIV1;                                // 高速时基时钟不分频
    EPwm5Regs.TBCTL.bit.CLKDIV = TB_DIV1;                                   // 时基时钟不分频
    EPwm5Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;                             // 使能CMPA影子寄存器
    EPwm5Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;                             // 使能CMPB影子寄存器
    EPwm5Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPA
    EPwm5Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPB
    EPwm5Regs.CMPA.bit.CMPA = 0;                                            // 设置A路比较值
    EPwm5Regs.AQCTLA.bit.ZRO = AQ_SET;                                      // 计数器归零时将A路输出置高
    EPwm5Regs.AQCTLA.bit.CAU = AQ_CLEAR;                                    // 上数到CMPA时将A路输出清低
    EPwm5Regs.AQCTLA.bit.CAD = AQ_SET;                                      // 下数到CMPA时将A路输出置高
    EPwm5Regs.AQCTLB.bit.ZRO = AQ_SET;                                      // 计数器归零时将B路原始输出置高
    EPwm5Regs.AQCTLB.bit.CBU = AQ_CLEAR;                                    // 上数到CMPB时将B路原始输出清低
    EPwm5Regs.AQCTLB.bit.CBD = AQ_SET;                                      // 下数到CMPB时将B路原始输出置高
    EPwm5Regs.DBCTL.bit.IN_MODE = 0;                                        // 选择ePWM A作为死区双沿输入
    EPwm5Regs.DBCTL.bit.POLSEL = 2;                                         // 设置互补输出极性
    EPwm5Regs.DBCTL.bit.OUT_MODE = 3;                                       // 同时使能上升沿和下降沿死区
    EPwm5Regs.DBRED.bit.DBRED = 15;                                         // 设置上升沿死区为15个TBCLK
    EPwm5Regs.DBFED.bit.DBFED = 15;                                         // 设置下降沿死区为15个TBCLK
    EPwm5Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;                               // 选择计数器归零作为ePWM中断事件
    EPwm5Regs.ETSEL.bit.INTEN = 0;                                          // 关闭未使用的ePWM中断请求
    EPwm5Regs.ETPS.bit.INTPRD = ET_1ST;                                     // 配置每次事件产生一次中断标志
}

void EPWM6_Init(void)                                                       // 初始化未使用的ePWM6
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR2.bit.EPWM6 = 1;                                       // 打开对应ePWM模块外设时钟
    EPwm6Regs.TZCTL.bit.TZA = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM6A为低
    EPwm6Regs.TZCTL.bit.TZB = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM6B为低
    EPwm6Regs.TZFRC.bit.OST = 1;                                            // 初始化期间立即锁存关断未使用的ePWM6输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    EPwm6Regs.AQSFRC.bit.RLDCSF = 3;                                        // AQ连续软件强制使用立即模式，仅用于清除可能残留的旧状态
    EPwm6Regs.AQCSFRC.bit.CSFA = 0;                                         // 禁用旧的ePWM6A AQ连续软件强制
    EPwm6Regs.AQCSFRC.bit.CSFB = 0;                                         // 禁用旧的ePWM6B AQ连续软件强制

    EPwm6Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;                              // 选择该ePWM的同步输出来源
    EPwm6Regs.TBCTL.bit.PHSEN = TB_ENABLE;                                  // 配置相位同步装载功能
    EPwm6Regs.TBPHS.all = 0;                                                // 将同步相位偏移清零
    EPwm6Regs.TBCTR = 0;                                                    // 将时基计数器清零
    EPwm6Regs.TBPRD = EPWM_TIMER_TBPRD;                                     // 设置中心对齐PWM周期值
    EPwm6Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;                          // 采用上下计数的中心对齐模式
    EPwm6Regs.TBCTL.bit.HSPCLKDIV = TB_DIV1;                                // 高速时基时钟不分频
    EPwm6Regs.TBCTL.bit.CLKDIV = TB_DIV1;                                   // 时基时钟不分频
    EPwm6Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;                             // 使能CMPA影子寄存器
    EPwm6Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;                             // 使能CMPB影子寄存器
    EPwm6Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPA
    EPwm6Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;                           // 在计数器归零时装载CMPB
    EPwm6Regs.CMPA.bit.CMPA = 0;                                            // 设置A路比较值
    EPwm6Regs.AQCTLA.bit.ZRO = AQ_SET;                                      // 计数器归零时将A路输出置高
    EPwm6Regs.AQCTLA.bit.CAU = AQ_CLEAR;                                    // 上数到CMPA时将A路输出清低
    EPwm6Regs.AQCTLA.bit.CAD = AQ_SET;                                      // 下数到CMPA时将A路输出置高
    EPwm6Regs.AQCTLB.bit.ZRO = AQ_SET;                                      // 计数器归零时将B路原始输出置高
    EPwm6Regs.AQCTLB.bit.CBU = AQ_CLEAR;                                    // 上数到CMPB时将B路原始输出清低
    EPwm6Regs.AQCTLB.bit.CBD = AQ_SET;                                      // 下数到CMPB时将B路原始输出置高
    EPwm6Regs.DBCTL.bit.IN_MODE = 0;                                        // 选择ePWM A作为死区双沿输入
    EPwm6Regs.DBCTL.bit.POLSEL = 2;                                         // 设置互补输出极性
    EPwm6Regs.DBCTL.bit.OUT_MODE = 3;                                       // 同时使能上升沿和下降沿死区
    EPwm6Regs.DBRED.bit.DBRED = 15;                                         // 设置上升沿死区为15个TBCLK
    EPwm6Regs.DBFED.bit.DBFED = 15;                                         // 设置下降沿死区为15个TBCLK
    EPwm6Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;                               // 选择计数器归零作为ePWM中断事件
    EPwm6Regs.ETSEL.bit.INTEN = 0;                                          // 关闭未使用的ePWM中断请求
    EPwm6Regs.ETPS.bit.INTPRD = ET_1ST;                                     // 配置每次事件产生一次中断标志
}
